{"entries":[{"title":"","url":"/","tags":[],"body":"Welcome to a work in progress This is the repository for best practices across our Digital Services Team Repositories Leics DST Jekyll template for docs Posts Welcome to Jekyll! 20 Nov 2013"},{"skip_index":true,"title":"Search results","url":"/search/","tags":[],"body":""},{"title":"","url":"/CONTRIBUTING.md","tags":[],"body":"If you'd like to contribute to this project, please use the fork-and-pull model: 1. Fork this repository to your personal account. 2. Create a branch and make your changes. 3. Test the changes locally/in your personal fork. 4. Submit a pull request to open a discussion about your proposed changes. 5. We'll talk about it and decide to merge or request additional changes. --- The project is in the public domain within the United States, and copyright and related rights in the work worldwide are waived through the [CC0 1.0 Universal public domain dedication][CC0]. All contributions to this project will be released under the CC0 dedication. By submitting a pull request, you are agreeing to comply with this waiver of copyright interest. [CC0]: http://creativecommons.org/publicdomain/zero/1.0/"},{"title":"","url":"/TERMS.md","tags":[],"body":"As a work of the United States Government, this package is in the public domain within the United States. Additionally, we waive copyright and related rights in the work worldwide through the CC0 1.0 Universal public domain dedication. Software source code previously released under an open source license and then modified by CFPB staff is considered a \"joint work\" (see 17 USC § 101); it is partially copyrighted, partially public domain, and as a whole is protected by the copyrights of the non-government authors and must be released according to the terms of the original open-source license. For further details, please see the CFPB [Source Code Policy][policy]. ## CC0 1.0 Universal Summary This is a human-readable summary of the [Legal Code (read the full text)][CC0]. ### No Copyright The person who associated a work with this deed has dedicated the work to the public domain by waiving all of his or her rights to the work worldwide under copyright law, including all related and neighboring rights, to the extent allowed by law. You can copy, modify, distribute and perform the work, even for commercial purposes, all without asking permission. See Other Information below. ### Other Information In no way are the patent or trademark rights of any person affected by CC0, nor are the rights that other persons may have in the work or in how the work is used, such as publicity or privacy rights. Unless expressly stated otherwise, the person who associated a work with this deed makes no warranties about the work, and disclaims liability for all uses of the work, to the fullest extent permitted by applicable law. When using or citing the work, you should not imply endorsement by the author or the affirmer. [policy]: http://github.com/cfpb/source-code-policy/ [CC0]: http://creativecommons.org/publicdomain/zero/1.0/legalcode ## This project makes use of: * [Respond.js](https://github.com/scottjehl/Respond) by Scott Jehl, licensed under the MIT license. * [The HTML5 Shiv](https://github.com/aFarkas/html5shiv), dual licensed under the MIT or GPL Version 2 licenses. *"},{"title":"Example Page","url":"/example_page/","tags":[],"body":"Hey! This is an example page. I have lots of cool content. Yay. One morning, when Gregor Samsa woke from troubled dreams, he found himself transformed in his bed into a horrible vermin. He lay on his armour-like back, and if he lifted his head a little he could see his brown belly, slightly domed and divided by arches into stiff sections. The bedding was hardly able to cover it and seemed ready to slide off any moment. His many legs, pitifully thin compared with the size of the rest of him, waved about helplessly as he looked. “What’s happened to me?” he thought. It wasn’t a dream. His room, a proper human room although a little too small, lay peacefully between its four familiar walls. A collection of textile samples lay spread out on the table - Samsa was a travelling salesman - and above it there hung a picture that he had recently cut out of an illustrated magazine and housed in a nice, gilded frame. It showed a lady fitted out with a fur hat and fur boa who sat upright, raising a heavy fur muff that covered the whole of her lower arm towards the viewer. Gregor then turned to look out the window at the dull weather. Drops"},{"title":"Welcome to Jekyll!","url":"/jekyll/update/2013/11/20/welcome-to-jekyll.html","tags":[],"body":"You’ll find this post in your _posts directory - edit this post and re-build (or run with the -w switch) to see your changes! To add new posts, simply add a file in the _posts directory that follows the convention: YYYY-MM-DD-name-of-post.ext. Jekyll also offers powerful support for code snippets: def print_hi(name) puts \"Hi, #{name}\" end print_hi('Tom') #=> prints 'Hi, Tom' to STDOUT. Check out the Jekyll docs for more info on how to get the most out of Jekyll. File all bugs/feature requests at Jekyll’s GitHub repo."}]}